########################################################
# Завдання №1
########################################################

# print(<обʼєкт>) - функція для виводу аргументу в консоль

print(0.135)

# str(<обʼєкт>) - показує внутрішню структуру будь-якого обʼєкту.

str(c(1, 2, 3, 4, 5, 6, 7, 10))

# c(<обʼєкт1>, <обʼєкт2>, ..., <обʼєкт_n>)

c(1, 2, 3, 4, 5, 6, 7, 10)

# seq(<початок>, <кінець>, <крок>) - створює вектор з арифметичної прогресією із заданим кроком.

seq(0, 10, 0.5)

# rep(<значення>, <кількість>) - повертає вектор, де задане значення повторюється задану кількість разів.

rep(1, 100)

# numeric(<довжина>) - створює числовий вектор (автоматичне заповнює нулями).

numeric(26)

# names(<вектор>) - повертає назви елементів вектора.

price_vector <- c("apple" = 5, "pear" = 10, "cherry" = 15)

names(price_vector)

# rbind(<вектор1>, <вектор2>, ..., <вектор_n>) - обʼєднує надані вектори-рядки в матрицю.

rbind(1:3, 4:6)

# cbind(<вектор1>, <вектор2>, ..., <вектор_n>) - обʼєднує надані вектори-стовпчики в матрицю.

cbind(1:3, 4:6)

# matrix(<вектор>) - повертає матрицю, що заповнюється значеннями з наданого вектору.
# Приймає параметри nrow=n та ncol=m для визначення кількості рядків та стовпців відповідно.

matrix(1:10, nrow=2, ncol=3)

# dimnames(<матриця>) - повертає назви рядків і стовпців матриці.

M = matrix(1:4, nrow=2, ncol=2)
dimnames(M) <- list(c("bi", "bo"), c("bi", "bo"))

# rownames(<матриця>) - повертає назви рядків.

rownames(M)

# colnames(<матриця>) - повертає назви стовпців.

colnames(M)

# diag(<вектор>) або diag(<матриця>) - якщо аргументом є матриця, то повертає
# її діагональ у вигляді вектору. Якщо вектор, то повертає діагональну
# матрицю.

diag(M)
diag(3:5)

# solve(<матриця> A, <вектор> b) - вирішує рівняння Ax=b, повертає вектор розвʼязків. Якщо аргументом буде лише матриця, то функція поверне її обернену матрицю. 

x <- c(1, 2)

solve(M, x)

# min(<масив>), max(<масив>) - повертають мінімальне та максимальне значення з масиву відповідно.

x <- 1:10
min(x)
max(c(324, 32, 43, 999, 87))

# sum(<масив>) - повертає суму елементів масиву.

sum(1:10)

# length(<масив>) - повертає кількість елементів масиву.

length(x)

# t(<матриця>) - транспонує задану матрицю

t(M)

# order(<масив>) - повертає масив індексів (з одиниці), за якими елементи розташовані
# в порядку зростання.

x <- c(7, 1, 5, 10, 8)
order(x)

# [1] 2 3 1 5 4
# Тобто у відсортованому масиві на першому місці стояв би другий елемент
# початкового масиву, на 2-му 3-ій і т.д.

# sort(<масив>) - повертає відсортований (за замовчуванням, у порядку зростання) масив. 














