########################################################
# Завдання №2
########################################################

remove_top_bottom <- function(arr, alpha=0.05){
    n <- length(arr)
    bound <- floor(n*alpha / 2)

    # Отримуємо масив індексів у порядку зростання відповідних елементів.
    # Видаляємо bound найменших елементів за їх індексами.
    indices <- order(arr)
    arr <- arr[-indices[1:bound]]

    # Маємо вже інший масив, тож перераховуємо знову його довжину та порядок.
    # Забираємо з нього найбільші елементи за їх індексами.
    n <- length(arr)
    indices <- order(arr)
    arr <- arr[-indices[(n-bound+1):n]]

    return(arr)
}

v <- c(4, 18, 19, 11, 15, 1, 10, 12, 17, 14, 16, 9, 13, 5, 2, 8, 7, 3, 20, 6)

print(remove_top_bottom(v, 0.2))
