use LW3::sha256;

fn main() {
    let p1 = "Щастям б'єш жук їх глицю в фон й ґедзь пріч.";
    let p2 = "Факт ґринджол: бій псюг вщух, з'їм шче яєць.";
    let p3 = "З'їв аґрусу — та ягода цілюща б'є жах інфекцій шипучим „ь“";
    let p4 = "Ґедзь же пояснює: годі! з'їв ще б чашу джему й цілих фруктів";
    let p5 = "Фабрикуймо гідність, лящім їжею, ґав хапаймо, з'єднавці чаш!";
    let p6 = "Юнкерський джинґл, що при безхліб'ї чує фашист, це ловця гімн.";
    let p7 = "Хвацький юшковар Філіп щодня на ґанку готує сім'ї вечерю з жаб";
    let p8 = "В Бахчисараї фельд'єґер зумів одягнути ящірці жовтий капюшон!";
    let p9 = "На подушечці форми любої є й ґудзик, щоб пір'я геть жовте сховати.";
    let p10 = "Щурячий бугай із їжаком-харцизом в'ючись підписали ґешефт у єнах.";


    let p1c = "Шастям б'єш жук їх глицю в фон й ґедзь пріч.";
    let p2c = "Фукт ґринджол: бій псюг вщух, з'їм шче яєць.";
    let p3c = "З'їу аґрусу — та ягода цілюща б'є жах інфекцій шипучим „ь“";
    let p4c = "Ґедсь же пояснює: годі! з'їв ще б чашу джему й цілих фруктів";
    let p5c = "Фабракуймо гідність, лящім їжею, ґав хапаймо, з'єднавці чаш!";
    let p6c = "Юнкерзький джинґл, що при безхліб'ї чує фашист, це ловця гімн.";
    let p7c = "Хвацькiй юшковар Філіп щодня на ґанку готує сім'ї вечерю з жаб";
    let p8c = "В Бахчиzараї фельд'єґер зумів одягнути ящірці жовтий капюшон!";
    let p9c = "На подушичці форми любої є й ґудзик, щоб пір'я геть жовте сховати.";
    let p10c = "Щурячий бугай із ёжаком-харцизом в'ючись підписали ґешефт у єнах.";

    let p1cc = "\x1b[31mШ\x1b[0mастям б'єш жук їх глицю в фон й ґедзь пріч.";
    let p2cc = "Ф\x1b[31mу\x1b[0mкт ґринджол: бій псюг вщух, з'їм шче яєць.";
    let p3cc = "З'ї\x1b[31mу\x1b[0m аґрусу — та ягода цілюща б'є жах інфекцій шипучим „ь“";
    let p4cc = "Ґед\x1b[31mс\x1b[0mь же пояснює: годі! з'їв ще б чашу джему й цілих фруктів";
    let p5cc = "Фабр\x1b[31mа\x1b[0mкуймо гідність, лящім їжею, ґав хапаймо, з'єднавці чаш!";
    let p6cc = "Юнкер\x1b[31mз\x1b[0mький джинґл, що при безхліб'ї чує фашист, це ловця гімн.";
    let p7cc = "Хвацьк\x1b[31mi\x1b[0mй юшковар Філіп щодня на ґанку готує сім'ї вечерю з жаб";
    let p8cc = "В Бахчи\x1b[31mz\x1b[0mараї фельд'єґер зумів одягнути ящірці жовтий капюшон!";
    let p9cc = "На подуш\x1b[31mи\x1b[0mчці форми любої є й ґудзик, щоб пір'я геть жовте сховати.";
    let p10cc = "Щурячий бугай із \x1b[31mё\x1b[0mжаком-харцизом в'ючись підписали ґешефт у єнах.";

    let p = [p1, p2, p3, p4, p5, p6, p7, p8, p9, p10];
    let pc = [p1c, p2c, p3c, p4c, p5c, p6c, p7c, p8c, p9c, p10c];
    let pcc = [p1cc, p2cc, p3cc, p4cc, p5cc, p6cc, p7cc, p8cc, p9cc, p10cc];


    println!("Лавинний ефект:");

    for i in 0..10 {
        println!("{}. {}", i+1, p[i]);
        println!("SHA256(-)={}", sha256::sha256_str(p[i]));
        println!("Зміна: {}", pcc[i]);
        println!("SHA256(-)={}", sha256::sha256_str(pc[i]));
        println!();
    }
 
}
